docs/BDD/Practicas/ej3-consultas.html
<!DOCTYPE html>
<html lang="es">
<head>
<!-- 2022-01-20 Thu 13:07 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ejercicio 3 Consultas</title>
<meta name="author" content="Alberto Robles Gomez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../css/index.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Ejercicio 3 Consultas</h1>
</header><ol class="org-ol">
<li><p>
Vuestro nombre sea un nuevo CLIENTE
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> CLIENTE <span class="org-rainbow-delimiters-depth-1">(</span>idcli, nombre, direc, ciudad, cpostal, telef, credit<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-keyword">VALUES</span> <span class="org-rainbow-delimiters-depth-1">(</span>6969, <span class="org-string">'Alberto Robles'</span>, <span class="org-string">'C/ Cacho, 69'</span>, <span class="org-string">'Trozo'</span>, 6969, 696969696, 696969<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div></li>

<li><p>
Insertar un nuevo registro de PEDIDO con fecha de hoy. El pedido
debe contener una de salchichas y algún artículo más.
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> PEDIDO <span class="org-rainbow-delimiters-depth-1">(</span>idped, idcli, fped, ffac<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-keyword">VALUES</span> <span class="org-rainbow-delimiters-depth-1">(</span>6969, 6969, <span class="org-string">'20/01/2022'</span>, <span class="org-string">'20/01/2022'</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> DETALLE <span class="org-rainbow-delimiters-depth-1">(</span>idped, idart, cantidad<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-keyword">VALUES</span> <span class="org-rainbow-delimiters-depth-1">(</span>6969, 4006, 69<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> DETALLE <span class="org-rainbow-delimiters-depth-1">(</span>idped, idart, cantidad<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-keyword">VALUES</span> <span class="org-rainbow-delimiters-depth-1">(</span>6969, 4008, 69<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div></li>

<li><p>
Confirmar con una select que visualice los artículos que habéis
pedido.
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> a.descrip
<span class="org-keyword">FROM</span>   detalle d, articulo a
<span class="org-keyword">WHERE</span>  d.idart = a.idart
  <span class="org-keyword">AND</span>  d.idped = 6969;
</pre>
</div></li>
</ol>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Alberto Robles Gomez</p>
<p class="date">Created: 2022-01-20 Thu 13:07</p>
</div>
</body>
</html>
